#+TITLE:Definitive Guide to HTML5 학습

** 객체 생성

   #+BEGIN_SRC browser :out img/5-12.adding.methods.to.an.object.png
     <!DOCTYPE HTML>
     <html>
       <head>
         <title>js example</title>
       </head>
       <body>
         <script type="text/javascript">
           var myData = new Object();
           myData.name = "Adam";
           myData.weather = "sunny";
           myData.print = function() {
             document.writeln("I am " + this.name);
             document.writeln("Today is " + this.weather);
           }
           myData.print()
         </script>
       </body>
     </html>
   #+END_SRC

   #+RESULTS[e7d2a0527806a7723c8470824df33563ec5cbd21]:
   : img/5-12.adding.methods.to.an.object.png

